{"metadata":{"title":"RESEARCH ON THE OPTIMIZATION OF DIJKSTRA’S","authors":[{"name":"ALGORITHM AND ITS APPLICATIONS"},{"name":"Arjun RK1"},{"name":"Pooja Reddy2"},{"name":"Shama3"},{"name":"M. Yamuna4"},{"name":"School of Advanced Sciences"},{"name":"Vellore Instutute of Technology"},{"name":"Vellore"},{"name":"Tamilnadu"},{"name":"(India )"}]},"abstract":[{"text":"The shortest path problem based on the data structure has become one of the hot research topics in graph theory. The shortest path problem is the problem of finding a path between two vertices (or nodes) in a graph such that the sum of the weights of its constituent edges is minimized. As the basic theory of solving this problem, Dijkstra’s algorithm has been widely used in engineering calculations. Aiming at the shortcomings of traditional Dijkstra’s algorithm, this paper has proposed an optimization method which has mainly improved the nodes selection of the shortest path and data storage structure and organization. Through comparison and analysis, the improved algorithm has been obtained, which has reduced the storage space and improved the operational efficiency."}],"body_text":[{"text":"I. INTRODUCTION\nThe shortest-route problem determines a route of minimum weight connecting two specified vertices, source and destination, in a weight graph (digraph) in a transportation network. A good algorithm used to find the shortest path between two known vertices is Dijkstra’s algorithm. Dijkstra’s algorithms used for calculating the shortest path, which introduced by the famous Dutch computer scientist Edsger W. Dijkstra, was recognized as the best algorithm that can be applied to get the shortest path from a node to any other nodes. However, with the development of the computer, the scale of the problems is increasing continuously, and meanwhile the use of traditional Dijkstra has increased the space and time complexity. Therefore, this paper has proposed the optimization of algorithm based on the data structure, which has very important significance for improving the efficiency of solving the shortest path algorithm."},{"text":"II. DIJKSTRA’S ALGORITHM\nGiven a graph and a source vertex in graph, find shortest paths from source to all vertices in the given graph. We generate a SPT (shortest path tree) with given source as root. We maintain two sets, one set contains vertices included in shortest path tree, and other set includes vertices not yet included in shortest path tree. At every step of the algorithm, we find a vertex which is in the other set (set of not yet included) and has minimum distance from source. Below are the detailed steps used in Dijkstra’s algorithm to find the shortest path from a single source vertex to all other vertices in the given graph. International Journal of Science, Technology & Management                                     www.ijstm.com Volume No 04, Special Issue No. 01, April 2015 ISSN (online): 2394-1537 305 | P a g e 2.1 Pseudo Code"},{"text":"III. DRAWBACKS OF THE TRADITIONAL DIJKSTRA’S ALGORITHM:\nIn network, the traditional Dijkstra’s algorithm has a wide application, but it is not difficult to find that its computation has gradually increased with the network increasing in complexity. If directly applied to calculating the best path of the urban road network, this algorithm will need a great amount of computation, and cannot meet the dynamic needs either. In addition, the adjacency matrix and incidence matrix used in the traditional algorithm to store network data will open up a huge storage space to store a large number of invalid OCJ elements and 0 elements, which is bound to cause huge waste of run time and can also reduce the computational efficiency in Matrix algorithm."},{"text":"IV. OPTIMIZED DIJKSTRA ALGORITHM:\nIn view of the problems mentioned above in Dijkstra’s algorithm, the selection is optimized for the shortest path node, the data storage and organization in this paper. 4.1. Analysis of Optimization Ideas 4.1.1 The Selection of the Shortest Path Nodes and Nodes Ranking In Dijkstra’s algorithm, each node in the network diagram will be changed from unmarked node to the shortest path node. This change requires scanning a large number of stored disorder unmarked nodes one by one, so that the shortest path of the intermediate node can be achieved. If calculating on the basis of this large amount of data, the calculation speed will be certainly affected. Now we can rank the nodes to be scanned according to the label value, and it needs only one iteration to obtain the eligible nodes, which increases the computational efficiency significantly. Here the heap sort method given by J.W.J Williams is used to select the shortest path node. In algorithm optimization, the original sorting nodes are stored disorderly in the one-dimensional array and then was ordered by heap sort to be changed into a small group, when all the nodes can be stored according to the structure and storage order of complete binary tree. After that, the 0 node stored is the heap element, followed by the left subtree and right subtree. The time complexity (log N) is 0 in the heap adjustment process, where N denotes the number of nodes to be ranked. Compared to the next shortest path node selection from a list or an array with disordered structure, this algorithm can highly improve running speed and reduce running time. International Journal of Science, Technology & Management                                     www.ijstm.com Volume No 04, Special Issue No. 01, April 2015 ISSN (online): 2394-1537 306 | P a g e 4.1.2 Data Storage and Organization Storing and organizing mass data by the adjacency matrix needs open uNxN storage space (where N represents the number of nodes) for a large sparse graph, which reduces the storage efficiency and computational efficiency greatly, so the adjacency list can be used to store the network expansion structure to reduce the storage space. The adjacency list is a kind of diagram chain stores structure, in which the node elements can be stored in an array. 4.2. The main idea of the improved Dijkstra algorithm : Give an array T [] and two sets S and adjacent, in which T [] stores the nodes to be sorted, S is the collection of labelled nodes, and adjacent is the collection of the adjacent points. Under initial conditions, T [] = adj [v0], S = {v0} First of all, use heap sort to adjust the array T [] into a small heap, take the heap top node which is also the first element of the array as the intermediate nodes, and then add it into the labeled nodes collection S; Then compare the difference sets indicated collection (adj [current] -S) with the current shortest path of any node Vi in the changed current collection of adjacent nodes; Then find the difference set between the unit set of adjacent nodes of all nodes in the S collection and S (denoted as U adj [S] - S), put these nodes into the array T in order, cover the node in the original array, and place a counter i to record the number of nodes. At last, adjust the first i elements in the array into a small heap based on the shortest path value, and take heap top as the next shortest path node and deposit it into S collection. Repeat this iterative cycle, until all the nodes are stored into the S collection. Now calculate the shortest path D [V] from the starting node v0 to any other node in the graph G according to the Dijkstra algorithm based on data structure, in which the storage structure selected in the graph G is the adjacent list."},{"text":"V. PSEUDO CODE\n#define n 1000 Void Dijkstra (Mgraph G, int V0,int T[ ] ,int D[ ] ,) { int i = 0,j, F[n] , T[n] ,p, k; for ( i = 0; i < GVexnum; i + + )"},{"text":"{F[i] = 0;D [i] = INFNITE; T[V] = 0; }\nfor (p = Gvextices[0]. firstarc; p; p = p - > nextarc) {K = p-> adjvex;D [k] = p-> info; T[i] =D [k] , i + + ; } F[0] = l;D [0] = 0; for ( j = l;j < GVexnum;j + +) {HeapAdjust (T[n] , i) ; HeapMin (T, current, distance, path); F[current] = 1; } for (p = Gvextices[ current ]. firstarc; p; p = p-> nextarc) { K = p-> adjvex; If( ! F[k]&& D[current] + (p-> info) <D [k] ) D [k] =D [current] + (p-> info) ; SearchAdj (S, T[n] , i) ; } } International Journal of Science, Technology & Management                                     www.ijstm.com Volume No 04, Special Issue No. 01, April 2015 ISSN (online): 2394-1537 307 | P a g e"},{"text":"VI. ANALYSIS\nFrom above it is clear that the improved Dijkstra’s algorithm not only effectively improves the calculations and running efficiency, but also greatly reduces the number of path in analyzing the shortest path. The traditional algorithm shows an increasing tendency, while the improved algorithm is not the case. In the early stage of the running, the search path of improved Dijkstra’s algorithm shows an increasing tendency, but at the latter stage of reaching the end path, it greatly reduced the number of stored paths, while at the end of the algorithm, the path stored in the memory is only 1 that is the shortest path. Therefore, the improved algorithm releases the storage space, reduces data redundancy, and improves the running time and efficiency."},{"text":"VII. EXAMPLE APPLICATION BUILT USING DEV C++\nAIM: Program to find the estimated delivery time of a shipment from a source city to a destination city in a city graph network. The program takes as input a file which contains the city names and the distance between them in format as shown and the source and destination cities of the shipment. By Dijkstra’s algorithm, the program calculates the shortest path between the 2 cities in the network and displays the shortest distance, the estimated delivery time and the route to be taken to achieve the same. Figure 1 Graphic Window Representing the Output after Compilation of the Above Example Figure 2 Text Window Comprising of Values for the Above Example that are Arbitrarily Chosen International Journal of Science, Technology & Management                                     www.ijstm.com Volume No 04, Special Issue No. 01, April 2015 ISSN (online): 2394-1537 308 | P a g e Figure 3.  Graphic Window Showing Arbitrary Distance Values Figure 4 Text Window Showing Arbitrary Distance Values"},{"text":"VIII.   CONCLUSION\nThis paper mainly studied the application of the shortest path algorithm based on the data structure, and proposed the improved Dijkstra’s algorithm, which optimized selection of the shortest path node and data storage structure and organization. Studies showed that, compared with the traditional Dijkstra’s algorithm, the optimized Dijkstra’s algorithm which has optimized the space complexity, time complexity and storage combination reduced the storage International Journal of Science, Technology & Management                                     www.ijstm.com Volume No 04, Special Issue No. 01, April 2015 ISSN (online): 2394-1537 309 | P a g e space, reduced data redundancy and greatly improved the running rate. It was clearly showed that the optimized"},{"text":"REFERENCES\n[1]  Y. Cao, The Shortest path algorithm in data structures. Yibin University, vol. 6, 2007,pp.82 -84. [2]  Taha, H. Operations research an introduction, ninth edition. Pearson publisher, 2011. [3]  Nar, D. Graph theory with applications to engineering and computer science, Prentice Hall, 1997. [4]  Sneyers J., Schrijvers, T. and Demoen B. Dijkstra's Algorithm with Fibonacci Heaps: An Executable Description in CHR. 20th Workshop on Logic Programming (WLP'06), Vienna, Austria, February 2006. [5]  Ravi, N., Sireesha, V. Using Modified Dijkstra’s Algorithm for Critical Path Method in a Project Network. International Journal of Computational and Applied Mathematics. Volume 5 number 2 pp 217-225. 2010. [6]  Introduction to Algorithms Book by Charles E. Leiserson, Clifford Stein, Ronald Rivest, and Thomas H. Cormen"}]}